tap "1password/tap"
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
brew "webp"
brew "autoenv"
brew "python@3.11"
brew "azure-cli"
brew "bat"
brew "btop"
brew "python@3.12"
brew "cmake"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "entr"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "make"
brew "mas"
brew "neovim"
brew "node"
brew "pnpm"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "starship"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yarn"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "bartender"
cask "betterdisplay"
cask "deepl"
cask "discord"
cask "docker"
cask "elgato-stream-deck"
cask "figma"
cask "font-input"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "logi-options-plus"
cask "maestral"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "obsidian"
cask "onyx"
cask "pgadmin4"
cask "rectangle-pro"
cask "shottr"
cask "spotify"
cask "tg-pro"
cask "visual-studio-code"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Hover for Safari", id: 1540705431
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "albert.tabout"
vscode "alefragnani.project-manager"
vscode "ankitbko.vscode-pull-request-azdo"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme.theme-dracula"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emids technologies - lab.hive-lsp"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "jdinhlife.gruvbox"
vscode "jmkrivocapich.drawfolderstructure"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nicoespeon.abracadabra"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "pokey.parse-tree"
vscode "pranaygp.vscode-css-peek"
vscode "quicktype.quicktype"
vscode "redcmd.tmlanguage-syntax-highlighter"
vscode "redhat.vscode-yaml"
vscode "sburg.vscode-javascript-booster"
vscode "sirmspencer.vscode-autohide"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-canadian-english"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
vscode "yatki.vscode-surround"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
