tap "1password/tap"
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
brew "autoenv"
brew "bat"
brew "bfs"
brew "btop"
brew "python@3.12"
brew "cmake"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "llvm@17"
brew "lua"
brew "luarocks"
brew "make"
brew "mas"
brew "ncdu"
brew "node"
brew "pnpm"
brew "poetry"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "sd"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "ugrep"
brew "unzip"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "bartender"
cask "betterdisplay"
cask "chatgpt"
cask "devtunnel"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "elgato-stream-deck"
cask "figma"
cask "firefox@developer-edition"
cask "font-input"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "github"
cask "google-chrome"
cask "istat-menus"
cask "karabiner-elements"
cask "maestral"
cask "mongodb-compass"
cask "obsidian"
cask "onyx"
cask "rectangle-pro"
cask "shottr"
cask "tg-pro"
cask "visual-studio-code"
cask "vlc"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Hover for Safari", id: 1540705431
mas "Messenger", id: 1480068668
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "antfu.file-nesting"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "jdinhlife.gruvbox"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicoespeon.abracadabra"
vscode "pkief.material-icon-theme"
vscode "sburg.vscode-javascript-booster"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-canadian-english"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "streetsidesoftware.code-spell-checker-scientific-terms"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "waderyan.gitblame"
vscode "yatki.vscode-surround"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
