tap "azure/functions"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "azure-cli"
brew "bat"
brew "bfs"
brew "btop"
brew "cocoapods"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mas"
brew "ncdu"
brew "neovim"
brew "node"
brew "perl"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "prettyping"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "sd"
brew "sevenzip"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "watchman"
brew "wget"
brew "xclip"
brew "yazi"
brew "yq"
brew "zoxide"
brew "azure/functions/azure-functions-core-tools@4"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alt-tab"
cask "appcleaner"
cask "bartender"
cask "bettertouchtool"
cask "chatgpt"
cask "devtunnel"
cask "discord"
cask "docker"
cask "elgato-stream-deck"
cask "figma"
cask "firefox"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "grandperspective"
cask "karabiner-elements"
cask "logi-options+"
cask "messenger"
cask "microsoft-edge"
cask "obs"
cask "onyx"
cask "raycast"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Refined GitHub", id: 1519867270
mas "Rules", id: 6461118886
mas "Sink It for Reddit", id: 6449873635
mas "TestFlight", id: 899247664
mas "Velja", id: 1607635845
mas "Vimari", id: 1480933944
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.file-nesting"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker-vscode-extension"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotenv.dotenv-vscode"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "jdinhlife.gruvbox"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "redhat.vscode-yaml"
vscode "sirmspencer.vscode-autohide"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-canadian-english"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
