tap "1password/tap"
tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
brew "autoenv"
brew "bat"
brew "bfs"
brew "btop"
brew "python@3.12"
brew "cmake"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "llvm@17"
brew "lua"
brew "luarocks"
brew "make"
brew "mas"
brew "ncdu"
brew "neovim"
brew "node"
brew "pipx"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "sd"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "ugrep"
brew "unzip"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "felixkratz/formulae/borders"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "appcleaner"
cask "bartender"
cask "betterdisplay"
cask "chatgpt"
cask "devtunnel"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "elgato-stream-deck"
cask "figma"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "google-chrome"
cask "istat-menus"
cask "karabiner-elements"
cask "keymapp"
cask "maestral"
cask "messenger"
cask "mongodb-compass"
cask "obsidian"
cask "onyx"
cask "pgadmin4"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Hush", id: 1544743900
mas "Refined GitHub", id: 1519867270
mas "Sink It for Reddit", id: 6449873635
mas "Velja", id: 1607635845
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "antfu.browse-lite"
vscode "antfu.file-nesting"
vscode "antfu.vite"
vscode "bradlc.vscode-tailwindcss"
vscode "brandonkirbyson.vscode-animations"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "jasonnutter.search-node-modules"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicoespeon.abracadabra"
vscode "prisma.prisma"
vscode "sburg.vscode-javascript-booster"
vscode "sirmspencer.vscode-autohide"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-canadian-english"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
