tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "ast-grep"
brew "bfs"
brew "btop"
brew "cocoapods"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mas"
brew "ncdu"
brew "neovim"
brew "node"
brew "oxipng"
brew "perl"
brew "pipx"
brew "pkgconf"
brew "pngquant"
brew "poppler"
brew "portaudio"
brew "prettyping"
brew "pyenv"
brew "pyenv-virtualenv"
brew "resvg"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "sevenzip"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tlrc"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "watchman"
brew "wget"
brew "xclip"
brew "yazi"
brew "yq"
brew "zimfw"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "basictex"
cask "bettertouchtool"
cask "chatgpt"
cask "claude"
cask "devtunnel"
cask "discord"
cask "docker"
cask "elgato-stream-deck"
cask "firefox"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "messenger"
cask "obsidian"
cask "onyx"
cask "shottr"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Refined GitHub", id: 1519867270
mas "Sink It", id: 6449873635
mas "TestFlight", id: 899247664
mas "Velja", id: 1607635845
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.file-nesting"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicoespeon.abracadabra"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "powerappstools.powerfx"
vscode "redhat.vscode-yaml"
vscode "sirmspencer.vscode-autohide"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-canadian-english"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
